package com.direction.common.utils.cache;

import org.springframework.cache.annotation.EnableCaching;
import org.springframework.context.annotation.Configuration;

// ~ File Information
// ====================================================================================================================

/**
 * 开启缓存配置.
 * 
 * <pre>
 * 	开启缓存配置
 * </pre>
 * 
 * @author liutao
 * @since $Rev$
 *
 */
@Configuration
@EnableCaching
public class EhCacheConfig {

	// ~ Static Fields
	// ==================================================================================================================

	// ~ Fields
	// ==================================================================================================================

	// ~ Constructors
	// ==================================================================================================================

	// ~ Methods
	// ==================================================================================================================

}
